experiments/socialnetwork_singlenode/expected_results/mixed_qps5500/wrk.log
Running 2m test @ http://ip-172-31-8-50.us-east-2.compute.internal:8080
  4 threads and 64 connections
  Thread calibration: mean lat.: 4.108ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 4.142ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 4.173ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 4.152ms, rate sampling interval: 15ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.04ms    2.52ms  48.99ms   76.65%
    Req/Sec     1.42k   159.98     2.36k    74.09%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.92ms
 75.000%    6.04ms
 90.000%    7.76ms
 99.000%   10.69ms
 99.900%   19.28ms
 99.990%   33.44ms
 99.999%   42.91ms
100.000%   49.02ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.756     0.000000            1         1.00
       1.861     0.100000        77171         1.11
       2.151     0.200000       154184         1.25
       2.395     0.300000       231124         1.43
       2.641     0.400000       308224         1.67
       2.919     0.500000       385263         2.00
       3.089     0.550000       423540         2.22
       3.309     0.600000       461952         2.50
       3.651     0.650000       500320         2.86
       4.963     0.700000       538738         3.33
       6.043     0.750000       577306         4.00
       6.343     0.775000       596654         4.44
       6.619     0.800000       615938         5.00
       6.883     0.825000       635047         5.71
       7.155     0.850000       654373         6.67
       7.443     0.875000       673462         8.00
       7.599     0.887500       683147         8.89
       7.759     0.900000       692684        10.00
       7.939     0.912500       702275        11.43
       8.143     0.925000       711850        13.33
       8.375     0.937500       721524        16.00
       8.511     0.943750       726409        17.78
       8.663     0.950000       731322        20.00
       8.823     0.956250       735982        22.86
       9.015     0.962500       740866        26.67
       9.239     0.968750       745633        32.00
       9.367     0.971875       747983        35.56
       9.511     0.975000       750349        40.00
       9.679     0.978125       752788        45.71
       9.863     0.981250       755200        53.33
      10.087     0.984375       757580        64.00
      10.223     0.985938       758759        71.11
      10.383     0.987500       759981        80.00
      10.559     0.989062       761160        91.43
      10.775     0.990625       762377       106.67
      11.023     0.992188       763560       128.00
      11.183     0.992969       764152       142.22
      11.375     0.993750       764754       160.00
      11.591     0.994531       765364       182.86
      11.863     0.995313       765969       213.33
      12.231     0.996094       766568       256.00
      12.463     0.996484       766869       284.44
      12.711     0.996875       767160       320.00
      13.047     0.997266       767456       365.71
      13.551     0.997656       767756       426.67
      14.287     0.998047       768055       512.00
      14.831     0.998242       768206       568.89
      15.615     0.998437       768358       640.00
      16.527     0.998633       768509       731.43
      17.791     0.998828       768658       853.33
      19.423     0.999023       768807      1024.00
      20.159     0.999121       768882      1137.78
      21.135     0.999219       768958      1280.00
      22.431     0.999316       769032      1462.86
      23.535     0.999414       769108      1706.67
      24.719     0.999512       769183      2048.00
      25.503     0.999561       769220      2275.56
      26.079     0.999609       769259      2560.00
      26.767     0.999658       769295      2925.71
      27.631     0.999707       769333      3413.33
      29.199     0.999756       769371      4096.00
      29.663     0.999780       769389      4551.11
      30.367     0.999805       769408      5120.00
      31.039     0.999829       769427      5851.43
      31.823     0.999854       769446      6826.67
      32.479     0.999878       769465      8192.00
      33.087     0.999890       769474      9102.22
      33.439     0.999902       769483     10240.00
      33.791     0.999915       769493     11702.86
      34.911     0.999927       769502     13653.33
      35.679     0.999939       769512     16384.00
      35.871     0.999945       769516     18204.44
      36.511     0.999951       769521     20480.00
      37.119     0.999957       769526     23405.71
      37.663     0.999963       769530     27306.67
      38.335     0.999969       769535     32768.00
      39.551     0.999973       769537     36408.89
      40.191     0.999976       769541     40960.00
      40.319     0.999979       769542     46811.43
      40.703     0.999982       769544     54613.33
      41.919     0.999985       769547     65536.00
      42.143     0.999986       769548     72817.78
      42.623     0.999988       769549     81920.00
      42.911     0.999989       769550     93622.86
      43.007     0.999991       769551    109226.67
      44.799     0.999992       769553    131072.00
      44.799     0.999993       769553    145635.56
      44.863     0.999994       769554    163840.00
      44.863     0.999995       769554    187245.71
      44.959     0.999995       769555    218453.33
      45.023     0.999996       769556    262144.00
      45.023     0.999997       769556    291271.11
      45.023     0.999997       769556    327680.00
      45.023     0.999997       769556    374491.43
      45.727     0.999998       769557    436906.67
      45.727     0.999998       769557    524288.00
      45.727     0.999998       769557    582542.22
      45.727     0.999998       769557    655360.00
      45.727     0.999999       769557    748982.86
      49.023     0.999999       769558    873813.33
      49.023     1.000000       769558          inf
#[Mean    =        4.040, StdDeviation   =        2.518]
#[Max     =       48.992, Total count    =       769558]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    2.12ms
 75.000%    5.35ms
 90.000%    6.95ms
 99.000%    9.71ms
 99.900%   13.88ms
 99.990%   25.44ms
 99.999%   34.49ms
100.000%   48.45ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.641     0.000000            1         1.00
       1.315     0.100000        77137         1.11
       1.538     0.200000       154092         1.25
       1.722     0.300000       230889         1.43
       1.903     0.400000       308012         1.67
       2.121     0.500000       385268         2.00
       2.261     0.550000       423603         2.22
       2.447     0.600000       461921         2.50
       2.745     0.650000       500326         2.86
       4.351     0.700000       538695         3.33
       5.351     0.750000       577196         4.00
       5.627     0.775000       596531         4.44
       5.875     0.800000       615671         5.00
       6.123     0.825000       634978         5.71
       6.379     0.850000       654219         6.67
       6.651     0.875000       673484         8.00
       6.799     0.887500       683217         8.89
       6.955     0.900000       692731        10.00
       7.127     0.912500       702357        11.43
       7.319     0.925000       711946        13.33
       7.543     0.937500       721518        16.00
       7.671     0.943750       726400        17.78
       7.811     0.950000       731168        20.00
       7.971     0.956250       735965        22.86
       8.151     0.962500       740764        26.67
       8.367     0.968750       745581        32.00
       8.487     0.971875       747969        35.56
       8.623     0.975000       750401        40.00
       8.775     0.978125       752741        45.71
       8.951     0.981250       755129        53.33
       9.175     0.984375       757620        64.00
       9.295     0.985938       758767        71.11
       9.439     0.987500       759984        80.00
       9.599     0.989062       761205        91.43
       9.799     0.990625       762387       106.67
      10.023     0.992188       763564       128.00
      10.159     0.992969       764167       142.22
      10.319     0.993750       764759       160.00
      10.487     0.994531       765360       182.86
      10.703     0.995313       765958       213.33
      10.959     0.996094       766560       256.00
      11.127     0.996484       766858       284.44
      11.319     0.996875       767158       320.00
      11.519     0.997266       767456       365.71
      11.807     0.997656       767757       426.67
      12.175     0.998047       768063       512.00
      12.391     0.998242       768208       568.89
      12.663     0.998437       768358       640.00
      12.991     0.998633       768511       731.43
      13.375     0.998828       768658       853.33
      13.943     0.999023       768807      1024.00
      14.263     0.999121       768882      1137.78
      14.687     0.999219       768959      1280.00
      15.103     0.999316       769032      1462.86
      15.695     0.999414       769109      1706.67
      16.383     0.999512       769183      2048.00
      16.847     0.999561       769221      2275.56
      17.279     0.999609       769258      2560.00
      17.903     0.999658       769295      2925.71
      18.671     0.999707       769333      3413.33
      19.967     0.999756       769371      4096.00
      20.527     0.999780       769389      4551.11
      21.919     0.999805       769408      5120.00
      22.959     0.999829       769427      5851.43
      23.855     0.999854       769446      6826.67
      24.911     0.999878       769465      8192.00
      25.167     0.999890       769474      9102.22
      25.519     0.999902       769483     10240.00
      26.255     0.999915       769493     11702.86
      27.087     0.999927       769503     13653.33
      29.311     0.999939       769512     16384.00
      29.887     0.999945       769516     18204.44
      30.559     0.999951       769521     20480.00
      31.215     0.999957       769527     23405.71
      31.823     0.999963       769530     27306.67
      32.303     0.999969       769535     32768.00
      32.431     0.999973       769537     36408.89
      32.831     0.999976       769540     40960.00
      33.183     0.999979       769542     46811.43
      33.407     0.999982       769544     54613.33
      33.887     0.999985       769547     65536.00
      34.143     0.999986       769548     72817.78
      34.431     0.999988       769549     81920.00
      34.495     0.999989       769550     93622.86
      34.559     0.999991       769551    109226.67
      35.295     0.999992       769553    131072.00
      35.295     0.999993       769553    145635.56
      35.903     0.999994       769554    163840.00
      35.903     0.999995       769554    187245.71
      36.351     0.999995       769555    218453.33
      36.767     0.999996       769556    262144.00
      36.767     0.999997       769556    291271.11
      36.767     0.999997       769556    327680.00
      36.767     0.999997       769556    374491.43
      37.471     0.999998       769557    436906.67
      37.471     0.999998       769557    524288.00
      37.471     0.999998       769557    582542.22
      37.471     0.999998       769557    655360.00
      37.471     0.999999       769557    748982.86
      48.447     0.999999       769558    873813.33
      48.447     1.000000       769558          inf
#[Mean    =        3.310, StdDeviation   =        2.381]
#[Max     =       48.416, Total count    =       769558]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  824802 requests in 2.50m, 318.44MB read
Requests/sec:   5498.69
Transfer/sec:      2.12MB